Repository: airtaxi/AT-Image-Converter
Catalog: AT Image Converter/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, ko_kr, zh_cn, zh_hant

# AppDescription
source: A simple and fast image converter supporting various formats including JPG, PNG, WEBP, AVIF, HEIF, ICO, and more.
ja_jp: JPG、PNG、WEBP、AVIF、HEIF、ICOなど、さまざまなフォーマットに対応したシンプルで高速な画像変換ツールです。
ko_kr: JPG, PNG, WEBP, AVIF, HEIF, ICO 등 다양한 포맷을 지원하는 간편하고 빠른 이미지 변환기입니다.
zh_cn: 支持 JPG、PNG、WEBP、AVIF、HEIF、ICO 等多种格式的简单快速图片转换工具。
zh_hant: 支援 JPG、PNG、WEBP、AVIF、HEIF、ICO 等多種格式的簡單快速圖片轉換工具。

# ImagesTitle.Text
source: Images
ja_jp: 画像
ko_kr: 이미지
zh_cn: 图片
zh_hant: 圖片

# FormatOptionsTitle.Text
source: Format Options
ja_jp: フォーマット設定
ko_kr: 포맷 옵션
zh_cn: 格式选项
zh_hant: 格式選項

# SizeOptionsTitle.Text
source: Size Options
ja_jp: サイズ設定
ko_kr: 크기 옵션
zh_cn: 尺寸选项
zh_hant: 尺寸選項

# SaveOptionsTitle.Text
source: Save Options
ja_jp: 保存設定
ko_kr: 저장 옵션
zh_cn: 保存选项
zh_hant: 儲存選項

# AddButton.Label
source: Add
ja_jp: 追加
ko_kr: 추가
zh_cn: 添加
zh_hant: 新增

# DeleteButton.Label
source: Delete
ja_jp: 削除
ko_kr: 삭제
zh_cn: 删除
zh_hant: 刪除

# ClearButton.Label
source: Clear
ja_jp: クリア
ko_kr: 초기화
zh_cn: 清除
zh_hant: 清除

# DropPlaceholder.Text
source: Drag and drop image files here
ja_jp: 画像ファイルをここにドラッグ＆ドロップしてください
ko_kr: 이미지 파일을 여기에 드래그 앤 드롭하세요
zh_cn: 将图片文件拖放到此处
zh_hant: 將圖片檔案拖放到此處

# OutputFormatComboBox.Header
source: Output Format
ja_jp: 出力形式
ko_kr: 출력 포맷
zh_cn: 输出格式
zh_hant: 輸出格式

# QualityNumberBox.Header
source: Quality
ja_jp: 品質
ko_kr: 품질
zh_cn: 质量
zh_hant: 品質

# RotationOptionsTitle.Text
source: Rotation Options
ja_jp: 回転設定
ko_kr: 회전 옵션
zh_cn: 旋转选项
zh_hant: 旋轉選項

# RotationToggleSwitch.Header
source: Rotation
ja_jp: 回転
ko_kr: 회전
zh_cn: 旋转
zh_hant: 旋轉

# RotationToggleSwitch.OnContent
source: On
ja_jp: オン
ko_kr: 켜짐
zh_cn: 开
zh_hant: 開

# RotationToggleSwitch.OffContent
source: Off
ja_jp: オフ
ko_kr: 꺼짐
zh_cn: 关
zh_hant: 關

# RotationSettingsComboBox.Header
source: Rotation Settings
ja_jp: 回転設定
ko_kr: 회전 설정
zh_cn: 旋转设置
zh_hant: 旋轉設定

# AutoRotateByExifItem.Content
source: Auto-rotate based on EXIF
ja_jp: EXIF情報に基づいて自動回転
ko_kr: EXIF 정보에 따라 회전
zh_cn: 根据EXIF信息自动旋转
zh_hant: 根據EXIF資訊自動旋轉

# RotateClockwise90Item.Content
source: Rotate 90° clockwise
ja_jp: 時計回りに90度回転
ko_kr: 시계 방향으로 90도 회전
zh_cn: 顺时针旋转90度
zh_hant: 順時針旋轉90度

# RotateCounterClockwise90Item.Content
source: Rotate 90° counter-clockwise
ja_jp: 反時計回りに90度回転
ko_kr: 반시계 방향으로 90도 회전
zh_cn: 逆时针旋转90度
zh_hant: 逆時針旋轉90度

# Rotate180Item.Content
source: Rotate 180°
ja_jp: 180度回転
ko_kr: 180도 회전
zh_cn: 旋转180度
zh_hant: 旋轉180度

# SizeSettingsComboBox.Header
source: Size Settings
ja_jp: サイズ設定
ko_kr: 크기 설정
zh_cn: 尺寸设置
zh_hant: 尺寸設定

# SizeUnitComboBox.Header
source: Size Unit
ja_jp: サイズ単位
ko_kr: 크기 단위
zh_cn: 尺寸单位
zh_hant: 尺寸單位

# NoResizeItem.Content
source: Do not resize
ja_jp: リサイズしない
ko_kr: 크기 변경 안 함
zh_cn: 不调整大小
zh_hant: 不調整大小

# ResizeToFillItem.Content
source: Resize to fill
ja_jp: フィルにリサイズ
ko_kr: 채우기로 크기 변경
zh_cn: 调整为填充
zh_hant: 調整為填滿

# ResizeToWidthItem.Content
source: Resize to width and keep aspect ratio
ja_jp: 幅に合わせてアスペクト比を維持
ko_kr: 너비에 맞춰 비율 유지
zh_cn: 按宽度调整并保持纵横比
zh_hant: 按寬度調整並保持長寬比

# ResizeToHeightItem.Content
source: Resize to height and keep aspect ratio
ja_jp: 高さに合わせてアスペクト比を維持
ko_kr: 높이에 맞춰 비율 유지
zh_cn: 按高度调整并保持纵横比
zh_hant: 按高度調整並保持長寬比

# PixelItem.Content
source: Pixel
ja_jp: ピクセル
ko_kr: 픽셀
zh_cn: 像素
zh_hant: 像素

# PercentItem.Content
source: Percent
ja_jp: パーセント
ko_kr: 퍼센트
zh_cn: 百分比
zh_hant: 百分比

# PrefixTextBox.Header
source: File Name Prefix
ja_jp: ファイル名接頭辞
ko_kr: 파일명 접두사
zh_cn: 文件名前缀
zh_hant: 檔名前綴

# PrefixPreviewTextBox.Header
source: File Name Prefix (Preview)
ja_jp: ファイル名接頭辞（プレビュー）
ko_kr: 파일명 접두사 (미리보기)
zh_cn: 文件名前缀（预览）
zh_hant: 檔名前綴（預覽）

# PrefixPreviewTextBox.PlaceholderText
source: No selected image
ja_jp: 画像が選択されていません
ko_kr: 선택된 이미지 없음
zh_cn: 未选择图片
zh_hant: 未選擇圖片

# OverwriteFileToggleSwitch.OnContent
source: Overwrite if file name exists
ja_jp: ファイル名が重複する場合は上書き
ko_kr: 파일명 중복 시 덮어쓰기
zh_cn: 文件名重复时覆盖
zh_hant: 檔名重複時覆蓋

# OverwriteFileToggleSwitch.OffContent
source: Rename if file name exists
ja_jp: ファイル名が重複する場合は名前変更
ko_kr: 파일명 중복 시 이름 변경
zh_cn: 文件名重复时重命名
zh_hant: 檔名重複時重新命名

# OutputFolderTitle.Text
source: Output Folder
ja_jp: 出力フォルダ
ko_kr: 출력 폴더
zh_cn: 输出文件夹
zh_hant: 輸出資料夾

# SameFolderRadioButton.Content
source: Save to the same folder
ja_jp: 同じフォルダに保存
ko_kr: 같은 폴더에 저장
zh_cn: 保存到同一文件夹
zh_hant: 儲存到同一資料夾

# PhotoFolderRadioButton.Content
source: Save to Photo Folder
ja_jp: 写真フォルダに保存
ko_kr: 사진 폴더에 저장
zh_cn: 保存到图片文件夹
zh_hant: 儲存到圖片資料夾

# CustomFolderRadioButton.Content
source: Save to:
ja_jp: 指定フォルダに保存:
ko_kr: 지정한 폴더에 저장:
zh_cn: 保存到指定文件夹:
zh_hant: 儲存到指定資料夾:

# SubfolderRadioButton.Content
source: Save to a subfolder named:
ja_jp: サブフォルダに保存:
ko_kr: 하위 폴더에 저장:
zh_cn: 保存到子文件夹:
zh_hant: 儲存到子資料夾:

# ConversionOptionsTitle.Text
source: Conversion Options
ja_jp: 変換設定
ko_kr: 변환 옵션
zh_cn: 转换选项
zh_hant: 轉換選項

# ParallelExecutionToggleSwitch.Header
source: Parallel Execution
ja_jp: 並列実行
ko_kr: 병렬 실행
zh_cn: 并行执行
zh_hant: 並行執行

# ParallelExecutionToggleSwitch.OnContent
source: On
ja_jp: オン
ko_kr: 켜짐
zh_cn: 开
zh_hant: 開

# ParallelExecutionToggleSwitch.OffContent
source: Off
ja_jp: オフ
ko_kr: 꺼짐
zh_cn: 关
zh_hant: 關

# PreserveFileDateToggleSwitch.Header
source: Preserve File Date
ja_jp: ファイル日付を保持
ko_kr: 파일 날짜 유지
zh_cn: 保留文件日期
zh_hant: 保留檔案日期

# PreserveFileDateToggleSwitch.OnContent
source: On
ja_jp: オン
ko_kr: 켜짐
zh_cn: 开
zh_hant: 開

# PreserveFileDateToggleSwitch.OffContent
source: Off
ja_jp: オフ
ko_kr: 꺼짐
zh_cn: 关
zh_hant: 關

# PreserveExifToggleSwitch.Header
source: Preserve EXIF Data
ja_jp: EXIF情報を保持
ko_kr: EXIF 설정 유지
zh_cn: 保留EXIF信息
zh_hant: 保留EXIF資訊

# PreserveExifToggleSwitch.OnContent
source: On
ja_jp: オン
ko_kr: 켜짐
zh_cn: 开
zh_hant: 開

# PreserveExifToggleSwitch.OffContent
source: Off
ja_jp: オフ
ko_kr: 꺼짐
zh_cn: 关
zh_hant: 關

# DeleteOriginalToggleSwitch.OnContent
source: Delete original file after conversion
ja_jp: 変換後に元のファイルを削除
ko_kr: 변환 이후 원본 파일 제거
zh_cn: 转换后删除原始文件
zh_hant: 轉換後刪除原始檔案

# DeleteOriginalToggleSwitch.OffContent
source: Keep original file after conversion
ja_jp: 変換後に元のファイルを保持
ko_kr: 변환 이후 원본 파일 제거 안함
zh_cn: 转换后保留原始文件
zh_hant: 轉換後保留原始檔案

# ConvertButtonContent
source: Convert
ja_jp: 変換
ko_kr: 변환
zh_cn: 转换
zh_hant: 轉換

# ConvertButtonNoImagesContent
source: Please add images
ja_jp: 画像を追加してください
ko_kr: 이미지를 추가하세요
zh_cn: 请添加图片
zh_hant: 請新增圖片

# ZoomInButton.Label
source: Zoom In
ja_jp: 拡大
ko_kr: 확대
zh_cn: 放大
zh_hant: 放大

# ZoomOutButton.Label
source: Zoom Out
ja_jp: 縮小
ko_kr: 축소
zh_cn: 缩小
zh_hant: 縮小

# ResetZoomButton.Label
source: Reset Zoom
ja_jp: ズームリセット
ko_kr: 확대/축소 초기화
zh_cn: 重置缩放
zh_hant: 重設縮放

# WidthPixel
source: Width (px)
ja_jp: 幅 (px)
ko_kr: 너비 (px)
zh_cn: 宽度 (px)
zh_hant: 寬度 (px)

# HeightPixel
source: Height (px)
ja_jp: 高さ (px)
ko_kr: 높이 (px)
zh_cn: 高度 (px)
zh_hant: 高度 (px)

# WidthPercent
source: Width (%)
ja_jp: 幅 (%)
ko_kr: 너비 (%)
zh_cn: 宽度 (%)
zh_hant: 寬度 (%)

# HeightPercent
source: Height (%)
ja_jp: 高さ (%)
ko_kr: 높이 (%)
zh_cn: 高度 (%)
zh_hant: 高度 (%)

source: Conversion started
ja_jp: 変換開始
ko_kr: 변환 시작
zh_cn: 开始转换
zh_hant: 開始轉換

# ConvertingFile
source: Converting {0}
ja_jp: {0} を変換中
ko_kr: {0} 변환 중
zh_cn: 正在转换 {0}
zh_hant: 正在轉換 {0}

# ConversionFileComplete
source: {0} → {1} Complete!
ja_jp: {0} → {1} 完了！
ko_kr: {0} → {1} 완료!
zh_cn: {0} → {1} 完成！
zh_hant: {0} → {1} 完成！

source: Conversion complete!
ja_jp: 変換完了！
ko_kr: 변환 완료!
zh_cn: 转换完成！
zh_hant: 轉換完成！

# ConversionCompleteDialogTitle
source: Conversion Complete
ja_jp: 変換完了
ko_kr: 변환 완료
zh_cn: 转换完成
zh_hant: 轉換完成

# ConversionCompleteDialogContent
source: {0} file(s) converted successfully.
ja_jp: {0}個のファイルが正常に変換されました。
ko_kr: {0}개의 파일이 성공적으로 변환되었습니다.
zh_cn: 已成功转换 {0} 个文件。
zh_hant: 已成功轉換 {0} 個檔案。

# DialogOkButton
source: OK
ko_kr: 확인
zh_cn: 确定
zh_hant: 確定

# DialogCancelButton
source: Cancel
ja_jp: キャンセル
ko_kr: 취소
zh_cn: 取消
zh_hant: 取消

# GhostscriptRequiredDialogTitle
source: Ghostscript Required
ja_jp: Ghostscriptが必要です
ko_kr: Ghostscript 필요
zh_cn: 需要Ghostscript
zh_hant: 需要Ghostscript

# GhostscriptRequiredDialogContent
source: PDF files require Ghostscript to be installed. Please install Ghostscript and try again. Download: https://www.ghostscript.com/releases/gsdnld.html
ja_jp: PDFファイルの変換にはGhostscriptのインストールが必要です。Ghostscriptをインストールしてから再試行してください。 ダウンロード: https://www.ghostscript.com/releases/gsdnld.html
ko_kr: PDF 파일을 변환하려면 Ghostscript가 설치되어 있어야 합니다. Ghostscript를 설치한 후 다시 시도해 주세요. 다운로드: https://www.ghostscript.com/releases/gsdnld.html
zh_cn: 转换PDF文件需要安装Ghostscript。请安装Ghostscript后重试。 下载: https://www.ghostscript.com/releases/gsdnld.html
zh_hant: 轉換PDF檔案需要安裝Ghostscript。請安裝Ghostscript後再試一次。 下載: https://www.ghostscript.com/releases/gsdnld.html

# ConversionFileFailed
source: {0} failed: {1}
ja_jp: {0} 失敗: {1}
ko_kr: {0} 실패: {1}
zh_cn: {0} 失败: {1}
zh_hant: {0} 失敗: {1}
